core/src/test/resources/invalidxml/control/request_invalid_action_namespace.xml

<?xml version="1.0"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
            s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <s:Body>
        <u:SetSomeValue xmlns:u="invalid">
            <SomeValue>foo&amp;bar</SomeValue>
        </u:SetSomeValue>
    </s:Body>
</s:Envelope>